---
type: PrintParameters
namespace: Autodesk.Revit.DB
version: 2024
members: 21
tags: [revit-api, class]
---

# PrintParameters

`Autodesk.Revit.DB.PrintParameters` · Revit 2024 · 21 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | ColorDepth | — | `public ColorDepthType ColorDepth { get ; set ; }` |
| Property | HiddenLineViews | — | `public HiddenLineViewsType HiddenLineViews { get ; set ; }` |
| Property | HideCropBoundaries | — | `public bool HideCropBoundaries { get ; set ; }` |
| Property | HideReforWorkPlanes | — | `public bool HideReforWorkPlanes { get ; set ; }` |
| Property | HideScopeBoxes | — | `public bool HideScopeBoxes { get ; set ; }` |
| Property | HideUnreferencedViewTags | — | `public bool HideUnreferencedViewTags { get ; set ; }` |
| Property | MarginType | — | `public MarginType MarginType { get ; set ; }` |
| Property | MaskCoincidentLines | 2015 | `public bool MaskCoincidentLines { get ; set ; }` |
| Property | OriginOffsetX | — | `public double OriginOffsetX { get ; set ; }` |
| Property | OriginOffsetY | — | `public double OriginOffsetY { get ; set ; }` |
| Property | PageOrientation | — | `public PageOrientationType PageOrientation { get ; set ; }` |
| Property | PaperPlacement | — | `public PaperPlacementType PaperPlacement { get ; set ; }` |
| Property | PaperSize | — | `public PaperSize PaperSize { get ; set ; }` |
| Property | PaperSource | — | `public PaperSource PaperSource { get ; set ; }` |
| Property | RasterQuality | — | `public RasterQualityType RasterQuality { get ; set ; }` |
| Property | ReplaceHalftoneWithThinLines | — | `public bool ReplaceHalftoneWithThinLines { get ; set ; }` |
| Property | UserDefinedMarginX | — | `[ ObsoleteAttribute ("This property is obsolete. Use OriginOffsetX instead.")] public double UserDefinedMarginX { get ; set ; }` |
| Property | UserDefinedMarginY | — | `[ ObsoleteAttribute ("This property is obsolete. Use OriginOffsetY instead.")] public double UserDefinedMarginY { get ; set ; }` |
| Property | ViewLinksinBlue | — | `public bool ViewLinksinBlue { get ; set ; }` |
| Property | Zoom | — | `public int Zoom { get ; set ; }` |
| Property | ZoomType | — | `public ZoomType ZoomType { get ; set ; }` |